Ran Plan for 2 projects:

1. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
1. dir: `infra/global/iam/roles/atlantis` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
**Plan Error**
```
the default workspace at path infra/us-east-1/mgmt/vpc is currently locked by another command that is running for this pull request.
Wait until the previous command is complete and try again
```

---
### 2. dir: `infra/global/iam/roles/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_eks_cluster.main["scde-dev-us-east-1"]: Read complete after 0s [id=scde-dev-us-east-1]
data.aws_iam_policy_document.assume_role_with_oidc: Reading...
data.aws_iam_policy_document.assume_role_with_oidc: Read complete after 0s [id=1855650393]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/CF3527C40042EA2A9E0A19B5C92CB4C9:sub" = "system:serviceaccount:default:provider-aws-*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::677160962006:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/CF3527C40042EA2A9E0A19B5C92CB4C9"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "AtlantisRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"  = "prod"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AmazonAdminAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "AtlantisRole"
    }

  # module.iam_assumable_role.aws_iam_role.this[0] will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::677160962006:role/AtlantisRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sts:TagSession",
                          - "sts:AssumeRole",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS     = "*"
                          - Service = []
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-01-02T11:36:27Z" -> null
      - force_detach_policies = false -> null
      - id                    = "AtlantisRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "AtlantisRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment"  = "prod"
          - "Organization" = "iog"
          - "Project"      = "scde"
          - "Terraform"    = "true"
          - "Tribe"        = "smartcontracts"
        } -> null
      - unique_id             = "AROAZ3KPQI7LEO73IRZOU" -> null
    }

  # module.iam_assumable_role.aws_iam_role_policy_attachment.custom[0] will be destroyed
  # (because aws_iam_role_policy_attachment.custom is not in configuration)
  - resource "aws_iam_role_policy_attachment" "custom" {
      - id         = "AtlantisRole-20240102113628057400000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "AtlantisRole" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + iam_role_arn       = (known after apply)
  + iam_role_name      = "AtlantisRole"
  + iam_role_path      = "/"
  + iam_role_unique_id = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/global/iam/roles/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fglobal%252Fiam%252Froles%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/global/iam/roles/atlantis`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`